# Parameters
nc: 80  # number of classes (overridden by dataset nc at train time)
scales: # model compound scaling constants, i.e. 'yolov8l' scale
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# Ablation: YOLOv8l baseline + MSFE only (no FSEM, no SOEP).
# MSFE refines neck P5 features (AIFI-style). Standard C2f replaces FSEM at
# P2/P3/P4; SOEP (SPDConv + CSP_FeatureFusion) is removed at P3.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  - [-1, 1, MSFE, [1024, 8]]       # 10  MSFE at neck P5 (AIFI-style refinement)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]      # 12  cat backbone P4
  - [-1, 3, C2f, [512]]            # 13  P4 branch (top-down)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]      # 15  cat backbone P3
  - [-1, 3, C2f, [256]]            # 16  P3 out (small)

  - [-1, 1, Conv, [256, 3, 2]]      # 17  down
  - [[-1, 13], 1, Concat, [1]]     # 18  cat P4 branch
  - [-1, 3, C2f, [512]]            # 19  P4 out (medium)

  - [-1, 1, Conv, [512, 3, 2]]      # 20  down
  - [[-1, 10], 1, Concat, [1]]     # 21  cat neck P5 (MSFE out)
  - [-1, 3, C2f, [1024]]           # 22  P5 out (large)

  - [[16, 19, 22], 1, Detect, [nc]]  # 23  Detect(P3, P4, P5) - anchor-free decoupled head
