# Parameters
nc: 80  # number of classes (overridden by dataset nc at train time)
scales: # model compound scaling constants, i.e. 'yolov8l' scale
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# Ablation: YOLOv8l baseline + SOEP only (no FSEM, no MSFE).
# SOEP = SPDConv (projected P2 -> P3) + CSP_FeatureFusion (OmniKernel).
# Standard C2f replaces FSEM at P2/P3/P4; standard C2f replaces MSFE at neck P5.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]      # 11  cat backbone P4
  - [-1, 3, C2f, [512]]            # 12  P4 branch (top-down)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]      # 14  cat backbone P3
  - [2, 1, SPDConv, [256]]         # 15  SOEP: inject projected P2 into P3
  - [[-1, -2], 1, Concat, [1]]     # 16  cat P3 + P2-projection
  - [-1, 1, CSP_FeatureFusion, []] # 17  SOEP: OmniKernel global-local fusion
  - [-1, 3, C2f, [256]]            # 18  P3 out (small)

  - [-1, 1, Conv, [256, 3, 2]]      # 19  down
  - [[-1, 12], 1, Concat, [1]]     # 20  cat P4 branch
  - [-1, 3, C2f, [512]]            # 21  P4 out (medium)

  - [-1, 1, Conv, [512, 3, 2]]      # 22  down
  - [[-1, 9], 1, Concat, [1]]      # 23  cat neck P5 (SPPF out)
  - [-1, 3, C2f, [1024]]           # 24  P5 out (large)

  - [[18, 21, 24], 1, Detect, [nc]]  # 25  Detect(P3, P4, P5) - anchor-free decoupled head
